#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>
```

Success! The configuration is valid.


```
</details>
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
module.network.data.aws_availability_zones.current: Reading...
data.aws_caller_identity.current: Reading...
module.cloud_watch_alarm_of_apigateway_4xx_alarm_when_more_than_half_of_accesses_are_error.aws_cloudwatch_metric_alarm.use_metric_query: Refreshing state... [id=porta_api_dev_apigateway_4xx_alarm_when_more_than_half_of_accesses_are_error]
data.aws_caller_identity.current: Read complete after 0s [id=218317313594]
module.network.data.aws_availability_zones.current: Read complete after 1s [id=ap-northeast-1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.cloud_watch_alarm_of_apigateway_4xx_alarm_when_more_than_half_of_accesses_are_error.aws_cloudwatch_metric_alarm.use_metric_query will be destroyed
  # (because aws_cloudwatch_metric_alarm.use_metric_query is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "use_metric_query" {
      - actions_enabled           = true -> null
      - alarm_actions             = [] -> null
      - alarm_description         = "devのAPI Gawatayで１分間にアクセス数の5割以上が4xxエラー" -> null
      - alarm_name                = "porta_api_dev_apigateway_4xx_alarm_when_more_than_half_of_accesses_are_error" -> null
      - arn                       = "arn:aws:cloudwatch:ap-northeast-1:218317313594:alarm:porta_api_dev_apigateway_4xx_alarm_when_more_than_half_of_accesses_are_error" -> null
      - comparison_operator       = "GreaterThanOrEqualToThreshold" -> null
      - datapoints_to_alarm       = 1 -> null
      - dimensions                = {} -> null
      - evaluation_periods        = 1 -> null
      - id                        = "porta_api_dev_apigateway_4xx_alarm_when_more_than_half_of_accesses_are_error" -> null
      - insufficient_data_actions = [] -> null
      - ok_actions                = [] -> null
      - period                    = 0 -> null
      - tags                      = {} -> null
      - tags_all                  = {} -> null
      - threshold                 = 50 -> null
      - treat_missing_data        = "missing" -> null

      - metric_query {
          - id          = "m1" -> null
          - period      = 0 -> null
          - return_data = false -> null

          - metric {
              - dimensions  = {
                  - "ApiName" = "test_api"
                } -> null
              - metric_name = "Count" -> null
              - namespace   = "AWS/ApiGateway" -> null
              - period      = 60 -> null
              - stat        = "Average" -> null
            }
        }
      - metric_query {
          - id          = "m2" -> null
          - period      = 0 -> null
          - return_data = false -> null

          - metric {
              - dimensions  = {
                  - "ApiName" = "test_api"
                } -> null
              - metric_name = "4XXError" -> null
              - namespace   = "AWS/ApiGateway" -> null
              - period      = 60 -> null
              - stat        = "Average" -> null
            }
        }
      - metric_query {
          - expression  = "100 * m2/m1" -> null
          - id          = "e1" -> null
          - label       = "Expression1" -> null
          - period      = 0 -> null
          - return_data = true -> null
        }
    }

  # module.network.aws_subnet.private_aurora[0] will be created
  + resource "aws_subnet" "private_aurora" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.16.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = "ip-name"
      + tags                                           = {
          + "Name" = "porta-aurora-dev-pri-a-sbn"
        }
      + tags_all                                       = {
          + "Name" = "porta-aurora-dev-pri-a-sbn"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.private_aurora[1] will be created
  + resource "aws_subnet" "private_aurora" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.17.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = "ip-name"
      + tags                                           = {
          + "Name" = "porta-aurora-dev-pri-c-sbn"
        }
      + tags_all                                       = {
          + "Name" = "porta-aurora-dev-pri-c-sbn"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.private_container[0] will be created
  + resource "aws_subnet" "private_container" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.8.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = "ip-name"
      + tags                                           = {
          + "Name" = "container-test-container-dev-pri-a-sbn"
        }
      + tags_all                                       = {
          + "Name" = "container-test-container-dev-pri-a-sbn"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.private_container[1] will be created
  + resource "aws_subnet" "private_container" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.9.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = "ip-name"
      + tags                                           = {
          + "Name" = "container-test-container-dev-pri-c-sbn"
        }
      + tags_all                                       = {
          + "Name" = "container-test-container-dev-pri-c-sbn"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.public_alb[0] will be created
  + resource "aws_subnet" "public_alb" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = "ip-name"
      + tags                                           = {
          + "Name" = "container-test-alb-dev-pub-a-sbn"
        }
      + tags_all                                       = {
          + "Name" = "container-test-alb-dev-pub-a-sbn"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.public_alb[1] will be created
  + resource "aws_subnet" "public_alb" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = "ip-name"
      + tags                                           = {
          + "Name" = "container-test-alb-dev-pub-c-sbn"
        }
      + tags_all                                       = {
          + "Name" = "container-test-alb-dev-pub-c-sbn"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_vpc.main will be created
  + resource "aws_vpc" "main" {
      + arn                                  = (known after apply)
      + assign_generated_ipv6_cidr_block     = false
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = false
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "container-test-dev-vpc"
        }
      + tags_all                             = {
          + "Name" = "container-test-dev-vpc"
        }
    }

Plan: 7 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pusher: @yusa0730, Action: `pull_request`, Working Directory: `environments/dev`, Workflow: `dev terraform ci`*